app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "6"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" IS NULL LIMIT 1
---
  def similar_director
    @movie = Movie.find(params[:id])
    @movies = Movie.find_all_by_director(@movie.director)